app/Controllers/Administrateur.php

SELECT *
FROM `administrateur`
WHERE `email_administrateur` = 'owenlambour@gmail.com'
---
    public function connexion()
    {
        if (isset($_POST["connecter"])) {
            /*récupérer l'admin en fonction de son email V
            vérifier le mot de passe V
            faire les cookies V
            rediriger vers l'accueil*/

            // On établit une connexion à la base de données
            $db = \Config\Database::connect();

            // On récupère l'administrateur en fonction de l'email saisi dans le formulaire
            $administrateurQuery = $db->table('administrateur')->getWhere(["email_administrateur" => $_POST["email"]]);

SELECT *
FROM `administrateur`
WHERE `email_administrateur` = 'admin@example.com'
INSERT INTO `administrateur` (`email_administrateur`, `pass_administrateur`, `pseudo_administrateur`) VALUES ('admin@example.com', '$2y$10$7Tjmy716Y22zLDWi68qGyuon7nOYtqTg79YM/K9t/HfidzylZmakS', 'ROBERT')
---
    public function creation()
    {
        if (isset($_POST['creer'])) {
            // On établit une connexion à la base de données
            $db = \Config\Database::connect();

            // On vérifie si l'email saisi dans le formulaire existe déjà dans la base de données
            $administrateurQuery = $db->table('administrateur')->getWhere(["email_administrateur" => $_POST["email"]]);
            $administrateurResult = $administrateurQuery->getResult("array");

            // Si l'email existe déjà, on affiche un message d'erreur
            if (isset($administrateurResult[0])) {
                $data['error'] = "Email déjà existant";
            } else if ($_POST["pass"] === $_POST["confirmPass"]) {
                // Si les mots de passe saisis dans le formulaire correspondent
                // On prépare les données de l'administrateur à insérer dans la base de données
                $admin = [
                    "email_administrateur" => $_POST["email"],
                    "pass_administrateur" => password_hash($_POST["pass"], PASSWORD_DEFAULT),
                    "pseudo_administrateur" => $_POST["pseudo"]
                ];

                // On insère les données de l'administrateur dans la base de données
                $db = \Config\Database::connect();
                $db->table('administrateur')->insert($admin);