app/Controllers/Jeu.php

    public function listeJoueur()
    {
        $db = \Config\Database::connect();

        $data['title'] = "Liste jeu";
        $data['css'] = "jeu/liste";

        if (isset($_POST["chercherjeu"])) {

            $builder = $db->table('jeu')
                ->join("editeur", 'jeu.id_editeur=editeur.id_editeur')
                ->join("developpeur", 'jeu.id_developpeur=developpeur.id_developpeur');

            if (isset($_POST["titre"]) && !empty($_POST["titre"])) {
                $builder = $builder->where("nom_jeu LIKE", "%" . $_POST["titre"] . "%");
            }
            if (isset($_POST["date_sortie"]) && !empty($_POST["date_sortie"])) {
                $builder = $builder->where("date_jeu", $_POST["date_sortie"]);
            }

            if (isset($_POST["developpeur"]) && !empty($_POST["developpeur"])) {
                $builder = $builder->where("jeu.id_developpeur", $_POST["developpeur"]);
            }

            if (isset($_POST["editeur"]) && !empty($_POST["editeur"])) {
                $builder = $builder->where("jeu.id_editeur", $_POST["editeur"]);
            }

            $builder = $builder->get();
---
SELECT *
FROM `jeu`
JOIN `editeur` ON `jeu`.`id_editeur`=`editeur`.`id_editeur`
JOIN `developpeur` ON `jeu`.`id_developpeur`=`developpeur`.`id_developpeur`
WHERE `date_jeu` = '2000-01-20'

            $datajeu['listeJeu'] = $this->selectionJeu();
        };

        $builder = $db->table('developpeur')
            ->get();

        $datarecherche['listeDeveloppeur'] = $builder->getResult("array");

        $builder = $db->table('editeur')
            ->get();
---
SELECT *
FROM `developpeur`
SELECT *
FROM `editeur`

    function selectionJeu()
    {
        $db = \Config\Database::connect();

        $builder = $db->table('jeu')
            ->join("editeur", 'jeu.id_editeur=editeur.id_editeur')
            ->join("developpeur", 'jeu.id_developpeur=developpeur.id_developpeur')
            // ->join("support", 'jeu.id_jeu=support.id_jeu')
            // ->join("plateforme", 'plateforme.id_plateforme=support.id_plateforme')
            ->get();
---
SELECT *
FROM `jeu`
JOIN `editeur` ON `jeu`.`id_editeur`=`editeur`.`id_editeur`
JOIN `developpeur` ON `jeu`.`id_developpeur`=`developpeur`.`id_developpeur`

    public function editer($id)
    {
        $db = \Config\Database::connect();

        $builder = $db->table('jeu')
            ->join("editeur", 'jeu.id_editeur=editeur.id_editeur')
            ->join("developpeur", 'jeu.id_developpeur=developpeur.id_developpeur')
            // ->join("support", 'jeu.id_jeu=support.id_jeu')
            // ->join("plateforme", 'plateforme.id_plateforme=support.id_plateforme')
            ->getWhere(["jeu.id_jeu" => $id]);

        $datajeu['jeu'] = $builder->getResult("array");
        $datajeu['jeu'] = $datajeu['jeu'][0];

        $builder = $db->table('developpeur')
            ->get();

        $datajeu['listeDeveloppeur'] = $builder->getResult("array");

        $builder = $db->table('editeur')
            ->get();

        $datajeu['listeEditeur'] = $builder->getResult("array");
---
SELECT *
FROM `jeu`
JOIN `editeur` ON `jeu`.`id_editeur`=`editeur`.`id_editeur`
JOIN `developpeur` ON `jeu`.`id_developpeur`=`developpeur`.`id_developpeur`
WHERE `jeu`.`id_jeu` = '1'
SELECT *
FROM `jeu`
JOIN `editeur` ON `jeu`.`id_editeur`=`editeur`.`id_editeur`
JOIN `developpeur` ON `jeu`.`id_developpeur`=`developpeur`.`id_developpeur`
WHERE `jeu`.`id_jeu` = '23'
SELECT *
FROM `developpeur`
SELECT *
FROM `editeur`
SELECT *
FROM `jeu`
JOIN `editeur` ON `jeu`.`id_editeur`=`editeur`.`id_editeur`
JOIN `developpeur` ON `jeu`.`id_developpeur`=`developpeur`.`id_developpeur`