app/Controllers/Jeu.php

SELECT *
FROM `jeu`
JOIN `editeur` ON `jeu`.`id_editeur`=`editeur`.`id_editeur`
JOIN `developpeur` ON `jeu`.`id_developpeur`=`developpeur`.`id_developpeur`
---
    public function listeAdmin()
    {
        $db = \Config\Database::connect();

        $builder = $db->table('jeu')
            ->join("editeur", 'jeu.id_editeur=editeur.id_editeur')
            ->join("developpeur", 'jeu.id_developpeur=developpeur.id_developpeur')
            // ->join("support", 'jeu.id_jeu=support.id_jeu')
            // ->join("plateforme", 'plateforme.id_plateforme=support.id_plateforme')
            ->get();