app/Controllers/Jeu.php

    public function afficher($id)
    {
        // Connexion à la base de données
        $db = \Config\Database::connect();

        // Construction de la requête SQL pour récupérer le jeu en fonction de son ID avec les informations sur les éditeurs et les développeurs
        $builder = $db->table('jeu')
            ->join("editeur", 'jeu.id_editeur=editeur.id_editeur')
            ->join("developpeur", 'jeu.id_developpeur=developpeur.id_developpeur')
            ->where('jeu.id_jeu', $id)
            ->get();

        // Vérifier si le jeu existe
        if ($builder->getNumRows() === 0) {
            // Affiche une page 404 si le jeu n'existe pas
            return $this->response->setStatusCode(404)->setBody(view('errors/html/error_404'));
        }

        // Récupération du jeu sous forme de tableau associatif
        $jeu = $builder->getRowArray();

        // Construction de la requête SQL pour récupérer les commentaires associés à ce jeu
        $builder = $db->table('commentaire')
            ->join('joueur', 'commentaire.id_joueur = joueur.id_joueur')
            ->where('id_jeu', $id)
            ->get();
---
SELECT *
FROM `jeu`
JOIN `editeur` ON `jeu`.`id_editeur`=`editeur`.`id_editeur`
JOIN `developpeur` ON `jeu`.`id_developpeur`=`developpeur`.`id_developpeur`
WHERE `jeu`.`id_jeu` = '2'
SELECT *
FROM `commentaire`
JOIN `joueur` ON `commentaire`.`id_joueur` = `joueur`.`id_joueur`
WHERE `id_jeu` = '2'