app/Controllers/Joueur.php

    public function connexion()
    {
        // Vérification si le formulaire de connexion a été soumis
        if (isset($_POST["connecter"])) {

            // Connexion à la base de données
            $db = \Config\Database::connect();

            // Requête pour récupérer le joueur en fonction de son email
            $joueurQuery = $db->table('joueur')->getWhere(["email_joueur" => $_POST["email"]]);
---
SELECT *
FROM `joueur`
WHERE `email_joueur` = 'owenlambour@gmail.com'

    public function creation()
    {
        // Vérification si le formulaire de création de compte a été soumis
        if (isset($_POST['creer'])) {

            // Connexion à la base de données
            $db = \Config\Database::connect();

            // Requête pour vérifier si l'email du joueur existe déjà dans la base de données
            $joueurQuery = $db->table('joueur')->getWhere(["email_joueur" => $_POST["email"]]);
            $joueurResult = $joueurQuery->getResult("array");

            // Vérification si l'email existe déjà
            if (isset($joueurResult[0])) {
                // L'email existe déjà, on affiche un message d'erreur
                $data['error'] = "Email déjà existant";
            } else if ($_POST["pass"] === $_POST["confirmPass"]) {
                // Les mots de passe correspondent, on peut créer le compte du joueur

                // Construction du tableau de données pour l'insertion du joueur dans la base de données
                $joueur = [
                    "email_joueur" => $_POST["email"],
                    "pass_joueur" => password_hash($_POST["pass"], PASSWORD_DEFAULT),
                    "pseudo_joueur" => $_POST["pseudo"]
                ];

                // Insertion du joueur dans la base de données
                $db = \Config\Database::connect();
                $db->table('joueur')->insert($joueur);
---
SELECT *
FROM `joueur`
WHERE `email_joueur` = 'admin@example.com'
INSERT INTO `joueur` (`email_joueur`, `pass_joueur`, `pseudo_joueur`) VALUES ('admin@example.com', '$2y$10$JZwxW6ssCvTh4G.DRuaspeY2FTBf62BzyTFum95o1OPcIe.Yi1Uga', 'Robert')